{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. clear
{txt}
{com}. set more off
{txt}
{com}. cd "C:\Users\wonja\Documents\GitHub\14.320\PS3"
{res}C:\Users\wonja\Documents\GitHub\14.320\PS3
{txt}
{com}. use STAR_public_use
{txt}
{com}. 
. * Problem 2.(a) i.
. 
. local all_treatments = "ssp sfp sfsp"
{txt}
{com}. foreach treatment in `all_treatments' {c -(}
{txt}  2{com}.     ttest grade_20059_fall if control == 1 | `treatment' == 1, by(control)
{txt}  3{com}.         eststo: quietly estpost ttest grade_20059_fall if control == 1 | `treatment' == 1, by(control)
{txt}  4{com}. {c )-}

{txt}Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}    212{col 22} 64.13365{col 34} .8680953{col 46} 12.63966{col 58}  62.4224{col 70}  65.8449
       {txt}1 {c |}{res}{col 12}    854{col 22} 63.85714{col 34} .4120091{col 46} 12.04026{col 58} 63.04847{col 70} 64.66581
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}  1,066{col 22} 63.91213{col 34} .3723244{col 46} 12.15626{col 58} 63.18156{col 70} 64.64271
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22}  .276505{col 34} .9331853{col 58}-1.554587{col 70} 2.107597
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res}  0.2963
{txt}Ho: diff = 0                                     degrees of freedom = {res}    1064

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.6165         {txt}Pr(|T| > |t|) = {res}0.7671          {txt}Pr(T > t) = {res}0.3835
{txt}({res}est1{txt} stored)

Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}    219{col 22} 65.83067{col 34} .7538433{col 46} 11.15586{col 58} 64.34492{col 70} 67.31642
       {txt}1 {c |}{res}{col 12}    854{col 22} 63.85714{col 34} .4120091{col 46} 12.04026{col 58} 63.04847{col 70} 64.66581
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}  1,073{col 22} 64.25994{col 34} .3628792{col 46} 11.88672{col 58} 63.54791{col 70} 64.97198
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22} 1.973527{col 34} .8987481{col 58} .2100199{col 70} 3.737034
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res}  2.1959
{txt}Ho: diff = 0                                     degrees of freedom = {res}    1071

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.9858         {txt}Pr(|T| > |t|) = {res}0.0283          {txt}Pr(T > t) = {res}0.0142
{txt}({res}est2{txt} stored)

Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}    119{col 22}  66.0979{col 34} .9801826{col 46} 10.69253{col 58} 64.15687{col 70} 68.03893
       {txt}1 {c |}{res}{col 12}    854{col 22} 63.85714{col 34} .4120091{col 46} 12.04026{col 58} 63.04847{col 70} 64.66581
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}    973{col 22} 64.13119{col 34} .3815353{col 46} 11.90121{col 58} 63.38246{col 70} 64.87992
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22} 2.240756{col 34} 1.162893{col 58}-.0413174{col 70}  4.52283
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res}  1.9269
{txt}Ho: diff = 0                                     degrees of freedom = {res}     971

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.9729         {txt}Pr(|T| > |t|) = {res}0.0543          {txt}Pr(T > t) = {res}0.0271
{txt}({res}est3{txt} stored)

{com}. esttab using PS3-2ai.tex, replace compress cells("b(label(diff) fmt(a3) star) t(fmt(a3))" se(par fmt(a3))) label nonumber mtitles(`all_treatments') stats(N, fmt(%9.0gc) label(Observations)) addnote("standard errors in parentheses" "@starlegend")
{res}{txt}(output written to {browse  `"PS3-2ai.tex"'})

{com}. eststo clear
{txt}
{com}. 
. * Problem 2.(a) i.
. 
. gen treat = 1 - control
{txt}
{com}. foreach treatment in `all_treatments' {c -(}
{txt}  2{com}.     eststo: reg grade_20059_fall treat if treat == 0 | `treatment' == 1
{txt}  3{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,066
{txt}{hline 13}{c +}{hline 34}   F(1, 1064)      = {res}     0.09
{txt}       Model {c |} {res} 12.9850142         1  12.9850142   {txt}Prob > F        ={res}    0.7671
{txt}    Residual {c |} {res} 157367.082     1,064  147.901393   {txt}R-squared       ={res}    0.0001
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0009
{txt}       Total {c |} {res} 157380.067     1,065  147.774711   {txt}Root MSE        =   {res} 12.161

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}grade_2005~l{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2}  .276505{col 26}{space 2} .9331853{col 37}{space 1}    0.30{col 46}{space 3}0.767{col 54}{space 4}-1.554587{col 67}{space 3} 2.107597
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 63.85714{col 26}{space 2}  .416157{col 37}{space 1}  153.44{col 46}{space 3}0.000{col 54}{space 4} 63.04056{col 67}{space 3} 64.67372
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

      Source {c |}       SS           df       MS      Number of obs   ={res}     1,073
{txt}{hline 13}{c +}{hline 34}   F(1, 1071)      = {res}     4.82
{txt}       Model {c |} {res} 678.872694         1  678.872694   {txt}Prob > F        ={res}    0.0283
{txt}    Residual {c |} {res} 150788.333     1,071  140.792094   {txt}R-squared       ={res}    0.0045
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0036
{txt}       Total {c |} {res} 151467.205     1,072  141.294035   {txt}Root MSE        =   {res} 11.866

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}grade_2005~l{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2} 1.973527{col 26}{space 2} .8987481{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .2100199{col 67}{space 3} 3.737034
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 63.85714{col 26}{space 2} .4060319{col 37}{space 1}  157.27{col 46}{space 3}0.000{col 54}{space 4} 63.06043{col 67}{space 3} 64.65385
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

      Source {c |}       SS           df       MS      Number of obs   ={res}       973
{txt}{hline 13}{c +}{hline 34}   F(1, 971)       = {res}     3.71
{txt}       Model {c |} {res} 524.422422         1  524.422422   {txt}Prob > F        ={res}    0.0543
{txt}    Residual {c |} {res} 137148.484       971  141.244577   {txt}R-squared       ={res}    0.0038
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0028
{txt}       Total {c |} {res} 137672.907       972  141.638793   {txt}Root MSE        =   {res} 11.885

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}grade_2005~l{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2} 2.240756{col 26}{space 2} 1.162893{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0413174{col 67}{space 3}  4.52283
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 63.85714{col 26}{space 2} .4066839{col 37}{space 1}  157.02{col 46}{space 3}0.000{col 54}{space 4} 63.05906{col 67}{space 3} 64.65522
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

{com}. esttab using PS3-2aii.tex, replace compress gaps cells("b(label(coef) fmt(a3) star) t(fmt(a3))" se(par fmt(a3))) label nonumber varlabels(treat "Fall grade" _cons "Constant") mtitles(`all_treatments') stats(N, fmt(%9.0gc) label(Observations)) addnote("standard errors in parentheses" "@starlegend")
{res}{txt}(output written to {browse  `"PS3-2aii.tex"'})

{com}. eststo clear
{txt}
{com}. 
. * Problem 2.(b) i.
. 
. eststo: reg grade_20059_fall `all_treatments'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,404
{txt}{hline 13}{c +}{hline 34}   F(3, 1400)      = {res}     2.49
{txt}       Model {c |} {res} 1058.00605         3  352.668683   {txt}Prob > F        ={res}    0.0585
{txt}    Residual {c |} {res} 197988.856     1,400  141.420611   {txt}R-squared       ={res}    0.0053
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0032
{txt}       Total {c |} {res} 199046.862     1,403  141.872318   {txt}Root MSE        =   {res} 11.892

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}grade_2005~l{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}ssp {c |}{col 14}{res}{space 2}  .276505{col 26}{space 2}  .912511{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-1.513531{col 67}{space 3} 2.066541
{txt}{space 9}sfp {c |}{col 14}{res}{space 2} 1.973527{col 26}{space 2}  .900752{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4} .2065578{col 67}{space 3} 3.740496
{txt}{space 8}sfsp {c |}{col 14}{res}{space 2} 2.240756{col 26}{space 2} 1.163618{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0418661{col 67}{space 3} 4.523379
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 63.85714{col 26}{space 2} .4069372{col 37}{space 1}  156.92{col 46}{space 3}0.000{col 54}{space 4} 63.05887{col 67}{space 3} 64.65542
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. esttab using PS3-2bi.tex, replace compress label nonumber stats(N, fmt(%9.0gc) label(Observations))
{res}{txt}(output written to {browse  `"PS3-2bi.tex"'})

{com}. eststo clear
{txt}
{com}. 
. * Problem 2.(c)
. 
. gen sfp_sfsp = 0
{txt}
{com}. replace sfp_sfsp = 1 if sfp == 1 | sfsp == 1
{txt}(400 real changes made)

{com}. eststo: reg grade_20059_fall ssp sfp_sfsp

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,404
{txt}{hline 13}{c +}{hline 34}   F(2, 1401)      = {res}     3.72
{txt}       Model {c |} {res} 1052.49996         2   526.24998   {txt}Prob > F        ={res}    0.0244
{txt}    Residual {c |} {res} 197994.362     1,401  141.323599   {txt}R-squared       ={res}    0.0053
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0039
{txt}       Total {c |} {res} 199046.862     1,403  141.872318   {txt}Root MSE        =   {res} 11.888

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}grade_2005~l{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}ssp {c |}{col 14}{res}{space 2}  .276505{col 26}{space 2} .9121979{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-1.512916{col 67}{space 3} 2.065926
{txt}{space 4}sfp_sfsp {c |}{col 14}{res}{space 2} 2.067611{col 26}{space 2} .7639381{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .5690247{col 67}{space 3} 3.566196
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 63.85714{col 26}{space 2} .4067976{col 37}{space 1}  156.98{col 46}{space 3}0.000{col 54}{space 4} 63.05914{col 67}{space 3} 64.65514
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. esttab using PS3-2c.tex, replace compress label nonumber varlabels(sfp_sfsp "Offered sfp or sfsp" _cons "Constant") stats(N, fmt(%9.0gc) label(Observations))
{res}{txt}(output written to {browse  `"PS3-2c.tex"'})

{com}. eststo clear
{txt}
{com}. 
. * Problem 2.(d)
. 
. eststo: reg grade_20059_fall ssp sfp_sfsp female gpa0 dad2 mom2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,278
{txt}{hline 13}{c +}{hline 34}   F(6, 1271)      = {res}    21.43
{txt}       Model {c |} {res} 16456.4289         6  2742.73814   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 162652.411     1,271  127.971999   {txt}R-squared       ={res}    0.0919
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0876
{txt}       Total {c |} {res}  179108.84     1,277   140.25751   {txt}Root MSE        =   {res} 11.312

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}grade_2005~l{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}ssp {c |}{col 14}{res}{space 2} .1821301{col 26}{space 2} .9143386{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4}-1.611649{col 67}{space 3} 1.975909
{txt}{space 4}sfp_sfsp {c |}{col 14}{res}{space 2} 2.132299{col 26}{space 2}  .766642{col 37}{space 1}    2.78{col 46}{space 3}0.005{col 54}{space 4} .6282759{col 67}{space 3} 3.636322
{txt}{space 6}female {c |}{col 14}{res}{space 2}-2.095959{col 26}{space 2} .6447654{col 37}{space 1}   -3.25{col 46}{space 3}0.001{col 54}{space 4}-3.360881{col 67}{space 3} -.831038
{txt}{space 8}gpa0 {c |}{col 14}{res}{space 2} .7812122{col 26}{space 2} .0745982{col 37}{space 1}   10.47{col 46}{space 3}0.000{col 54}{space 4} .6348631{col 67}{space 3} .9275614
{txt}{space 8}dad2 {c |}{col 14}{res}{space 2} .7483422{col 26}{space 2} .7047745{col 37}{space 1}    1.06{col 46}{space 3}0.289{col 54}{space 4}-.6343071{col 67}{space 3} 2.130991
{txt}{space 8}mom2 {c |}{col 14}{res}{space 2}-.7034552{col 26}{space 2}  .730616{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4}-2.136801{col 67}{space 3} .7298907
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.543017{col 26}{space 2} 5.870677{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-7.974267{col 67}{space 3}  15.0603
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. esttab using PS3-2d.tex, replace compress label nonumber varlabels(sfp_sfsp "Offered sfp or sfsp" female "Female" _cons "Constant") stats(N, fmt(%9.0gc) label(Observations))
{res}{txt}(output written to {browse  `"PS3-2d.tex"'})

{com}. eststo clear
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\wonja\Documents\GitHub\14.320\PS3\PS3-2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}28 Mar 2021, 14:03:06
{txt}{.-}
{smcl}
{txt}{sf}{ul off}