{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. clear
{txt}
{com}. set more off
{txt}
{com}. cd "C:\Users\wonja\Documents\GitHub\14.320\PS3"
{res}C:\Users\wonja\Documents\GitHub\14.320\PS3
{txt}
{com}. use NHIS2009_clean
{txt}
{com}. 
. * Problem 3.(a)
. 
. * select non-missings
.         keep if marradult==1 & perweight!=0 
{txt}(50,662 observations deleted)

{com}.                 by serial: egen hi_hsb = mean(hi_hsb1)
{txt}(207 missing values generated)

{com}.                         keep if hi_hsb!=. & hi!=.
{txt}(207 observations deleted)

{com}.                 by serial: egen female = total(fml)
{txt}
{com}.                         keep if female==1
{txt}(31 observations deleted)

{com}.                         drop female
{txt}
{com}.         
. * Josh's sample selection criteria      
.         gen angrist = ( age>=26 & age<=59 & marradult==1 & adltempl>=1 )
{txt}
{com}.                 keep if angrist==1
{txt}(9,613 observations deleted)

{com}.         // drop single-person HHs
.         by serial: gen n = _N
{txt}
{com}.                 keep if n>1
{txt}(1,331 observations deleted)

{com}. 
. eststo: reg health uninsured if sex == 1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     9,395
{txt}{hline 13}{c +}{hline 34}   F(1, 9393)      = {res}   110.10
{txt}       Model {c |} {res} 98.7315707         1  98.7315707   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8423.39786     9,393  .896773966   {txt}R-squared       ={res}    0.0116
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0115
{txt}       Total {c |} {res} 8522.12943     9,394   .90718857   {txt}Root MSE        =   {res} .94698

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      health{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}uninsured {c |}{col 14}{res}{space 2}-.2777127{col 26}{space 2} .0264673{col 37}{space 1}  -10.49{col 46}{space 3}0.000{col 54}{space 4}-.3295943{col 67}{space 3}-.2258311
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.578563{col 26}{space 2} .0495989{col 37}{space 1}   51.99{col 46}{space 3}0.000{col 54}{space 4} 2.481338{col 67}{space 3} 2.675787
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. esttab using PS3-3a.tex, replace compress cells("b(label(coef) fmt(a3) star) ci(par fmt(a3))" t(par fmt(a3))) label varlabels(uninsured "Covered by insurance" _cons "Constant") nonumber stats(N, fmt(%9.0gc) label(Observations)) addnote("t statistics in parentheses" "@starlegend")
{res}{txt}(output written to {browse  `"PS3-3a.tex"'})

{com}. eststo clear
{txt}
{com}. 
. * Problem 3.(b)
. 
. eststo: reg health uninsured age if sex == 1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     9,395
{txt}{hline 13}{c +}{hline 34}   F(2, 9392)      = {res}   199.59
{txt}       Model {c |} {res} 347.434273         2  173.717137   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8174.69516     9,392  .870389178   {txt}R-squared       ={res}    0.0408
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0406
{txt}       Total {c |} {res} 8522.12943     9,394   .90718857   {txt}Root MSE        =   {res} .93295

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      health{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}uninsured {c |}{col 14}{res}{space 2}-.3326014{col 26}{space 2} .0262764{col 37}{space 1}  -12.66{col 46}{space 3}0.000{col 54}{space 4}-.3841089{col 67}{space 3} -.281094
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0189746{col 26}{space 2} .0011225{col 37}{space 1}   16.90{col 46}{space 3}0.000{col 54}{space 4} .0167743{col 67}{space 3}  .021175
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.850366{col 26}{space 2} .0651419{col 37}{space 1}   28.41{col 46}{space 3}0.000{col 54}{space 4} 1.722674{col 67}{space 3} 1.978058
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}. eststo: reg health uninsured age yedu if sex == 1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     9,395
{txt}{hline 13}{c +}{hline 34}   F(3, 9391)      = {res}   287.14
{txt}       Model {c |} {res} 716.032755         3  238.677585   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 7806.09668     9,391  .831231677   {txt}R-squared       ={res}    0.0840
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0837
{txt}       Total {c |} {res} 8522.12943     9,394   .90718857   {txt}Root MSE        =   {res} .91172

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      health{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}uninsured {c |}{col 14}{res}{space 2}-.1265868{col 26}{space 2} .0274791{col 37}{space 1}   -4.61{col 46}{space 3}0.000{col 54}{space 4}-.1804517{col 67}{space 3}-.0727219
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0185387{col 26}{space 2} .0010972{col 37}{space 1}   16.90{col 46}{space 3}0.000{col 54}{space 4}  .016388{col 67}{space 3} .0206894
{txt}{space 8}yedu {c |}{col 14}{res}{space 2}-.0701384{col 26}{space 2} .0033307{col 37}{space 1}  -21.06{col 46}{space 3}0.000{col 54}{space 4}-.0766674{col 67}{space 3}-.0636095
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.448775{col 26}{space 2} .0697144{col 37}{space 1}   35.13{col 46}{space 3}0.000{col 54}{space 4}  2.31212{col 67}{space 3}  2.58543
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est2{txt} stored)

{com}. eststo: reg health uninsured age yedu inc if sex == 1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     9,395
{txt}{hline 13}{c +}{hline 34}   F(4, 9390)      = {res}   286.00
{txt}       Model {c |} {res} 925.505667         4  231.376417   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 7596.62376     9,390  .809012115   {txt}R-squared       ={res}    0.1086
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1082
{txt}       Total {c |} {res} 8522.12943     9,394   .90718857   {txt}Root MSE        =   {res} .89945

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      health{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}uninsured {c |}{col 14}{res}{space 2}  -.00728{col 26}{space 2}  .028105{col 37}{space 1}   -0.26{col 46}{space 3}0.796{col 54}{space 4}-.0623718{col 67}{space 3} .0478118
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0204035{col 26}{space 2} .0010886{col 37}{space 1}   18.74{col 46}{space 3}0.000{col 54}{space 4} .0182696{col 67}{space 3} .0225373
{txt}{space 8}yedu {c |}{col 14}{res}{space 2}-.0487491{col 26}{space 2} .0035446{col 37}{space 1}  -13.75{col 46}{space 3}0.000{col 54}{space 4}-.0556973{col 67}{space 3}-.0418009
{txt}{space 9}inc {c |}{col 14}{res}{space 2}-3.10e-06{col 26}{space 2} 1.93e-07{col 37}{space 1}  -16.09{col 46}{space 3}0.000{col 54}{space 4}-3.48e-06{col 67}{space 3}-2.72e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.147955{col 26}{space 2} .0712719{col 37}{space 1}   30.14{col 46}{space 3}0.000{col 54}{space 4} 2.008247{col 67}{space 3} 2.287664
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est3{txt} stored)

{com}. esttab using PS3-3b.tex, replace compress cells(b(label(coef) fmt(a3) star) t(par fmt(a3))) label varlabels(uninsured "Covered by insurance" yedu "Years of education" inc "Income" _cons "Constant") nonumber stats(N, fmt(%9.0gc) label(Observations)) addnote("t statistics in parentheses" "@starlegend")
{res}{txt}(output written to {browse  `"PS3-3b.tex"'})

{com}. eststo clear
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\wonja\Documents\GitHub\14.320\PS3\PS3-3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}28 Mar 2021, 18:49:02
{txt}{.-}
{smcl}
{txt}{sf}{ul off}